Repository: marcosjunqueira/sonar-l10n-pt-omegat
Catalog: tm/ruby-omegat.tmx
Source language: en_us
Languages: pt_br

source: An umbrella module covering all modules required for Ruby support: editing, projects, Rails, etc.
pt_br: Um módulo geral que cobre todos os módulos obrigatórios para Ruby: edição, projetos, Rails, etc.

source: Ruby support: editing, projects, Rails, etc.
pt_br: Suporte Ruby: edição, projetos, Rails, etc.

source: For information on recent changes, see http://wiki.netbeans.org/wiki/view/RubyRecentChanges
pt_br: Para maiores informações sobre mudanças recentes, veja http://wiki.netbeans.org/wiki/view/RubyRecentChanges

source: For more information, see http://wiki.netbeans.org/wiki/view/Ruby
pt_br: Para maiores informações, veja http://wiki.netbeans.org/wiki/view/Ruby

source: Common Scripting Language API
pt_br: API Comum de Linguagem de Scripts

source: API for defining custom languages in the IDE
pt_br: API para definição de linguagens personalizadas no IDE

source: Not enough memory to process file: {0}
pt_br: Sem memória suficiente para processar o arquivo: {0}

source: Common Scripting Language Support
pt_br: Suporte comum para linguagem de script

source: Generic Support for language integration in the IDE
pt_br: Suporte genérico para integração de linguagem no IDE

source: Generic Language Editor (Pending: Provide this string via language plugin?)
pt_br: Editor de linguagem genérico (Pendente: Fornecer esta string via plugin de linguagem?)

source: Generic Language Editor
pt_br: Editor de linguagem genérico

source: Source files for {0}
pt_br: Códigos-fontes para {0}

source: Generic Scripting Language
pt_br: Linguagem de script genérica

source: Select Next Element
pt_br: Selecionar próximo elemento

source: Select Previous Element
pt_br: Selecionar elemento anterior

source: Expand All C&ode
pt_br: Expandir todos os códigos-f&onte

source: Collapse All Code
pt_br: Ocultar todos os códigos-fontes

source: Expand All Code
pt_br: Expandir todos os códigos-fontes

source: Insertion Point to Previous Camel Case Position
pt_br: Inserção de ponto no Camel Case anterior

source: Insertion Point to Next Camel Case Position
pt_br: Inserção de ponto no próximo Camel Case

source: Extend Selection to Previous Camel Case Position
pt_br: Estender a seleção até o Camel Case anterior

source: Extend Selection to Next Camel Case Position
pt_br: Estender a seleção até o próximo Camel Case

source: Delete to Previous Camel Case Position
pt_br: Excluir até a posição Camel Case anterior

source: Delete to Next Camel Case Position
pt_br: Excluir até o a posição do próximo Camel Case

source: The specified name is not valid for use in a {0} source file: {1}
pt_br: O nome especificado não é válido para uso em um {0} arquivo de código-fonte: {1}

source: Navigate
pt_br: Navegar

source: Go to Source
pt_br: Ir para o código-fonte

source: Pretty Print
pt_br: Impressão elegante

source: Default
pt_br: Padrão

source: Embedded Language Fragment
pt_br: Fragmento de linguagem embarcado

source: Error
pt_br: Erro

source: Comment
pt_br: Comentário

source: Line Comment
pt_br: Comentário de linha

source: Regular Expression
pt_br: Expressão regular

source: String Escape
pt_br: String de escape

source: Invalid String
pt_br: String inválida

source: Character
pt_br: Caractere

source: Number
pt_br: Número

source: Keyword
pt_br: Palavra-chave

source: Whitespace
pt_br: Espaço em branco

source: Identifier
pt_br: Identificador

source: Punctuation
pt_br: Pontuação

source: Operator
pt_br: Operador

source: Annotation
pt_br: Anotação

source: Tag
pt_br: Marcação

source: Symbol
pt_br: Símbolo

source: Other Symbol
pt_br: Outro símbolo

source: Attribute Name
pt_br: Nome do atributo

source: Attribute Value
pt_br: Valor do atributo

source: Tag Whitespace
pt_br: Marcador de espaço branco

source: Field (Instance Variable)
pt_br: Campo (variável de instância)

source: Static Field (Class Variable)
pt_br: Campo estático (variável de classe)

source: Parameter
pt_br: Parâmetro

source: Static
pt_br: Estático

source: Constant
pt_br: Constante

source: Type Symbol
pt_br: Tipo do símbolo

source: Rename
pt_br: Renomear

source: Cannot perform rename here
pt_br: Não é possível renomear aqui

source: Go to Cl&ass...
pt_br: Ir para Cl&asse...

source: Class...
pt_br: Classe...

source: Show Javadoc
pt_br: Exibir Javadoc

source: Javadoc not found.
pt_br: Javadoc não encontrado.

source: Use the Library Manager to specify Javadoc for classpath items and the Java Platform Manager to specify Javadoc for JDKs.
pt_br: Utilize o Gerenciador de bibliotecas para especificar o Javadoc para os items do classpath e o Gerenciador de plataforma Java para especificar o Javadoc para JDKs.

source: Length of array.
pt_br: Tamanho do array.

source: java.lang.Class constant.
pt_br: Constante java.lang.Class.

source: Source
pt_br: Código-fonte

source: Package {0} not found.
pt_br: O pacote {0} não foi encontrado.

source: Source file for {0} not found.
pt_br: O código-fonte {0} não foi encontrado.

source: Java Indentation Engine
pt_br: Mecanismo de indentação Java

source: Indentation engine for Java files.
pt_br: Mecanismo de indentação para arquivos Java.

source: Add Newline Before Brace
pt_br: Adicionar nova linha antes de uma chave

source: If True, puts curly braces on the following line.
pt_br: Se verdadeiro, insere uma chave na linha seguinte.

source: Add Space Before Parenthesis
pt_br: Adicionar um espaço antes de parênteses

source: If True, adds a space before opening parenthesis.
pt_br: Se verdadeiro, adiciona um espaço de abrir parênteses

source: Add Leading Star in Comment
pt_br: Adicionar asterisco no comentário

source: If True, adds asterisk to lines beginning inside block comments.
pt_br: Se verdadeiro, adiciona asterisco no ínicio de cada linha dentro de um bloco de comentário.

source: Statement Continuation Indent
pt_br: Indentação para continuidade de experessão

source: Shift for second and subsequent lines in a multi-line statement.
pt_br: Desloca para a segunda linha e subseqüentes um uma expressão de múltiplas linhas.

source: Go to previous page
pt_br: Ir para página anterior

source: Go to next page
pt_br: Ir para próxima página

source: Show Javadoc in external web browser
pt_br: Exibir Javadoc em navegador externo

source: Open source in editor
pt_br: Abrir o código-fonte no editor

source: <font color="#7c0000">Javadoc not found.</font> Either Javadoc documentation for this item does not exist or you have not added specified Javadoc in the Java Platform Manager or the Library Manager.
pt_br: <font color="#7c0000">O Javadoc não foi encontrado.</font> A documentação do Javadoc para este item não existe ou você não adicionou o Javadoc específico para o Gerenciador de plataformas Java no Gerenciador de bibliotecas.

source: Opening {0}...
pt_br: Abrindo {0}...

source: Class "{0}" is already imported.
pt_br: A classe "{0}" já foi importada.

source: Package "{0}" is already imported.
pt_br: O pacote "{0}" já foi importado.

source: Goto Javadoc
pt_br: Ir para Javadoc

source: Expand All J&avadoc
pt_br: Expandir todos os J&avadoc

source: Collapse All &Javadoc
pt_br: Ocultar todos os &Javadoc

source: Expand All Java C&ode
pt_br: Expandir todos os códigos-f&onte Java

source: Collapse All Ja&va Code
pt_br: Ocultar todos os códigos-f&onte Java

source: Expand All Javadoc
pt_br: Expandir todos os Javadoc

source: Collapse All Javadoc
pt_br: Ocultar todos os Javadoc

source: Expand All Java Code
pt_br: Expandir todos os códigos-fonte Java

source: Collapse All Java Code
pt_br: Ocultar todos os códigos-fonte Java

source: Go to Super Implementation
pt_br: Ir para a implementação da super classe

source: Super Implementation
pt_br: Implementação da super classe

source: Fixing imports...
pt_br: Corrigindo imports...

source: All used types are already imported.
pt_br: Todos os tipos utilizados já sofreram import.

source: Imports were fixed.
pt_br: Todos os imports foram corrigidos.

source: No imports found for the following types:
pt_br: Nenhum import foi localizado para os seguintes tipos:

source: Cannot perform Fix Imports on a source with syntax errors.
pt_br: Não é possível realizar Corrigir imports em um código-fonte onde existe erro de sintaxe.

source: Fix Imports
pt_br: Corrigir imports

source: Searching for unresolved types ...
pt_br: Pesquisando por tipos não resolvidos ...

source: <html>The following class names were found in more than one package.
pt_br: <html>Os seguintes nomes de classes foram encontados em mais de um pacote.

source: Select the fully qualified name to use in the import statement:</html>
pt_br: Selecione a classe mais apropriada para utilizar na expressão de import:</html>

source: Class Name
pt_br: Nome da classe

source: Fully Qualified Name
pt_br: Classe apropriada

source: Choose appropriate fully qualified name
pt_br: Escolha a classe apropriada

source: Fully Qualified Names
pt_br: Classes apropriadas

source: Cannot open element "{0}".
pt_br: Não é possível abrir o elemento "{0}".

source: No parameters
pt_br: Sem parâmetros

source: Parameters:
pt_br: Parâmetros:

source: Returns:
pt_br: Retorna:

source: Throws:
pt_br: Excessões:

source: See Also:
pt_br: Veja também:

source: Since:
pt_br: Desde:

source: Cannot initialize code templates while scanning in progress...
pt_br: Não é possível inicializar modelos de códigos enquanto está analisando...

source: Go To Declaration
pt_br: Ir para declaração

source: Scanning in progress...
pt_br: Análise em andamento...

source: Java Editor
pt_br: Editor Java

source: Case Sensitive Code Completion
pt_br: Caso sensível para auto-completar

source: If True, the completion query search will be case sensitive
pt_br: Se verdadeiro, a busca por elementos no auto-completar irá distingüir maiúsculas e minúsculas

source: Code Completion Natural Sort
pt_br: Ordenação natural do auto-completar

source: If True, the completion search results will be sorted naturally
pt_br: Se verdadeiro, o resultado da busca do auto-completar será ordenada de forma natural

source: Code Completion Lowercase Substitution
pt_br: Substituição do auto-completar em letras minúsculas

source: If True, HTML Code Completion will be available in lower case.
pt_br: Se verdadeiro, o auto-completar para código HTML estará disponível para letras minúsculas.

source: Fast Import Package
pt_br: Importação rápida de pacotes

source: If True, fast import dialog will offer packages
pt_br: Se verdadeiro, o diálogo de import rápido oferecerá pacotes

source: Go To Class Case Sensitivity
pt_br: Caso sensível em Ir para classe

source: If True, Go To Class search will be case sensitive
pt_br: Se verdadeiro, a pesquisa em Ir para classe irá distingüir maiúsculas e minúsculas

source: Go To Class Show Inner Classes
pt_br: Exibir classes internas em Ir para classe

source: If True, Go To Class search will search also inner classes
pt_br: Se verdadeiro, a pesquisa em Ir para classe irá considerar também classes internas

source: Go To Class Show Library Classes
pt_br: Exibir classes da biblioteca em Ir para classe

source: If True, Go To Class search will search library classes
pt_br: Se verdadeiro, a pesquisa em Ir para classe irá considerar classes da biblioteca

source: Update Code Completion Database After Mounting
pt_br: Atualizar banco de dados auto-completar depois de montar

source: Mounted filesystem will be added into the Code Completion Database.
pt_br: Sistema de arquivos montado será adicionado ao banco de dados auto-completar.

source: Show Deprecated Members in Code Completion
pt_br: Exibir membros obsoletos no auto-completar

source: If True, deprecated members are shown in code completion.
pt_br: Se verdadeiro, membros obsoletos irão aparecer no auto-completar.

source: Java Keyword
pt_br: Palavra-chave Java

source: Java keyword.
pt_br: Palavra-chave Java

source: keyword
pt_br: Palavra-chave

source: Java Operator
pt_br: Operador Java

source: Java operator.
pt_br: Operador Java.

source: Assignment
pt_br: Atribuição

source: Assignment operator.
pt_br: Atribuição de operador.

source: Less Than
pt_br: Menor do que

source: "Less than" operator.
pt_br: Operador "Menor do que".

source: Greater Than
pt_br: Maior do que

source: "Greater than" operator.
pt_br: Operador "Maior do que".

source: Left Shift
pt_br: Deslocar à esquerda

source: Left shift operator.
pt_br: Operador de deslocamento à esquerda.

source: Right shift
pt_br: Deslocar à direita

source: Right Shift operator.
pt_br: Operador de deslocamento à direita.

source: Right Unsigned Shift
pt_br: Deslocamento não assinado à direita

source: Right unsigned shift operator.
pt_br: Operador de deslocamento não assinado à direita.

source: Plus
pt_br: Mais

source: Plus operator.
pt_br: Operador mais.

source: Minus
pt_br: Menos

source: Minus operator.
pt_br: Operador menos.

source: Multiply
pt_br: Multiplicação

source: Multiply operator.
pt_br: Operador de multiplicação.

source: Division
pt_br: Divisão

source: Division operator.
pt_br: Operador de divisão.

source: And operator.
pt_br: Operador And.

source: Or operator.
pt_br: Operador Or.

source: Xor operator.
pt_br: Operador Xor.

source: Modulo
pt_br: Módulo

source: Modulo (reminder) operator.
pt_br: Operador de módulo (resto da divisão).

source: Logical not operator.
pt_br: Operador lógico Not.

source: Negation
pt_br: Negação

source: Negation operator.
pt_br: Operador de negação.

source: Equivalence
pt_br: Equivalência

source: Equivalence operator.
pt_br: Operador de equivalência.

source: Less Or Equal
pt_br: Menor ou igual

source: "Less or equal" operator.
pt_br: Operador "Menor ou igual".

source: Greater Or Equal
pt_br: Maior ou igual

source: "Greater or equal" operator.
pt_br: Operador "Maior ou igual".

source: Dot
pt_br: Ponto

source: Dot operator.
pt_br: Operador ponto.

source: Comma
pt_br: Vírgula

source: Comma operator.
pt_br: Operador vírgula.

source: Increment
pt_br: Incremento

source: Increment operator.
pt_br: Operador de incremento.

source: Decrement
pt_br: Decremento

source: Decrement operator.
pt_br: Operador de decremento.

source: Numeric Literal
pt_br: Literal numérico

source: Numeric constant.
pt_br: Constante numérica.

source: Integer Literal
pt_br: Literal inteiro

source: Integer constant.
pt_br: Constante inteira.

source: Long Integer Literal
pt_br: Literal longo inteiro

source: Long integer constant.
pt_br: Constante longa inteira.

source: Hexadecimal Literal
pt_br: Literal hexadecimal

source: Hexadecimal constant.
pt_br: Constante hexadecimal.

source: Octal Literal
pt_br: Literal octal

source: Octal constant.
pt_br: Constante octal.

source: Float Literal
pt_br: Literal ponto-flutuante

source: Floating-point constant.
pt_br: Constante ponto-flutuante.

source: Double Literal
pt_br: Literal Double

source: Double floating-point constant.
pt_br: Constante ponto flutuante Double.

source: Error In Sources
pt_br: Erro em código-fonte

source: Erroneous text (marked by the compiler).
pt_br: Texto errôneo (marcado pelo compilador).

source: error
pt_br: erro

source: Whitespace.
pt_br: Espaço em branco.

source: Java Identifier
pt_br: Identificador Java

source: Java identifier.
pt_br: Identificador Java.

source: Java Annotation
pt_br: Anotação Java

source: Java Annotation.
pt_br: Anotação Java.

source: Single-line Comment
pt_br: Comentário em linha única

source: Single-line comment.
pt_br: Comentário em linha única.

source: // line-comment
pt_br: // comentário em linha

source: Block Comment
pt_br: Comentário em bloco

source: Block (multi-line) comment.
pt_br: Comentário em bloco (várias linhas).

source: /* block comment */
pt_br: /* comentário em bloco */

source: Character Literal
pt_br: Caractere literal

source: Character constant.
pt_br: Constante de caractere.

source: String constant.
pt_br: Constante de String.

source: Java Method Call
pt_br: Chamada de método Java

source: Java method (or constructor) call.
pt_br: Chamada de método Java (ou construtor).

source: method()
pt_br: metodo()

source: Code Folding
pt_br: Dobramento de código

source: Use Code Folding
pt_br: Usar dobramento de código

source: U
pt_br: C

source: Fold Types Collapsed by Default:
pt_br: Tipos de dobramentos ativados por padrão:

source: Method
pt_br: Método

source: Inner Class
pt_br: Classe interna

source: Import
pt_br: Importar

source: Javadoc Comment
pt_br: Comentário Javadoc

source: Initial Comment
pt_br: Comentário inicial

source: Add semicolon
pt_br: Adicionar ponto-e-vírgula

source: Cast {0} to {1}
pt_br: Converter {0} para {1}

source: Add throws clause for {0}
pt_br: Adicionar cláusula trows para {0}

source: Add import for {0}
pt_br: Adicionar import para {0}

source: Implement all abstract methods
pt_br: Implementar todos os métodos abstratos

source: Create field {0} on {1}
pt_br: Criar campo {0} em {1}

source: Create method {0} on {1}
pt_br: Criar método {0} em {1}

source: Create local variable {0}
pt_br: Criar variável local {0}

source: Create parameter {0}
pt_br: Criar parâmetro {0}

source: Create getter
pt_br: Criar getter

source: Create setter
pt_br: Criar setter

source: Create getter and setter
pt_br: Criar getter e setter

source: Implement missing methods
pt_br: Implementar os métodos que estão faltando

source: Rename to {0}
pt_br: Renomear para {0}

source: Declare in {0}
pt_br: Declarar em {0}

source: Go to overriding method ...
pt_br: Ir para o método sobreescrito ...

source: Getting overriding methods
pt_br: Obtendo métodos sobreescritos

source: {0} overriding method(s) found
pt_br: {0} sobreescrevendo método(s) encontrado(s)

source: No overriding methods found
pt_br: Nenhuma sobreescrita de método encontrada

source: Implement method in ...
pt_br: Implementar métodos em ...

source: Getting subclasses
pt_br: Obtendo subclasses

source: All known subclasses already implement this method
pt_br: Todas as subclasses conhecidas já implementam este método

source: {0} subclass(es) found
pt_br: {0} subclasse(s) encontrada(s)

source: Cancel
pt_br: Cancelar

source: Retouche
pt_br: Retocar

source: Tools
pt_br: Ferramentas

source: Java Source Infrastructure
pt_br: Infra-estrutura do código Java

source: This module provides Java Source API and its implementation
pt_br: Este módulo fornece a API de código Java e sua implementação

source: &Navigation
pt_br: &Navegação

source: Collecting Project Dependencies...
pt_br: Obtendo dependências do projeto...

source: Scanning {0}
pt_br: Analisando {0}

source: Compiling {0}
pt_br: Compilando {0}

source: Indexing {0}
pt_br: Indexando {0}

source: Updating
pt_br: Atualizando

source: Java - Navigation
pt_br: Java - Navegação

source: Adds support for structural views of Java sources to the Navigator component
pt_br: Adicionar suporte para visualização estrutural de códigos Java ao componente Navegador

source: Enables the Navigator component to display structural views of Java source files
pt_br: Habilita o componente Navegador para exibir visualização estrutural de códigos Java

source: Inheritance View
pt_br: Visualização de herança

source: Members View
pt_br: Visualização de membros

source: Move to superclass
pt_br: Mover para superclasse

source: <No Members Available>
pt_br: <Membros não disponíveis>

source: Invalid object
pt_br: Objeto inválido

source: Show Class Methods and Variables
pt_br: Exibir métodos e variáveis de classe

source: Show Non Public Members
pt_br: Exibir membros não-públicos

source: Show Fields
pt_br: Exibir campos

source: Show Inherited Members
pt_br: Exibir membros herdados

source: Show non public members
pt_br: Exibir membros não-públicos

source: Show fields
pt_br: Exibir campos

source: Show inherited members
pt_br: Exibir membros herdados

source: Constructors
pt_br: Construtores

source: Methods
pt_br: Métodos

source: Fields
pt_br: Campos

source: Structure
pt_br: Estrutura

source: Filters:
pt_br: Filtros:

source: View
pt_br: Visualização

source: Select a type of view
pt_br: Selecione um tipo de visualização

source: Click or press {0} to hide/show when Navigator is active
pt_br: Clique ou pressione {0} para exibir/ocultar quando o Navegador estiver ativo

source: Shorten Names
pt_br: Nomes abreviados

source: No filters
pt_br: Nenhum filtro

source: Invalid...
pt_br: Inválido...

source: Quick Search
pt_br: Pesquisa rápida

source: Override
pt_br: Sobreescrever

source: Implement
pt_br: Implementar

source: Sort by Name
pt_br: Ordenar por nome

source: Sort by Source
pt_br: Ordenar pelo código

source: Go to source
pt_br: Ir para o código-fonte

source: Source not available for {0}
pt_br: Código-fonte não disponível para {0}

source: Filters
pt_br: Filtros

source: Common Scripting Language Platform Support
pt_br: Suporte da plataforma das linguagens de script comuns

source: Infrastructure
pt_br: Infra-estrutura

source: APIs for handling paths in the Common Scripting Language Framework
pt_br: APIs para manipular caminhos no Framework de linguagens de script comuns

source: Java Platform Manager
pt_br: Gerenciador de plataforma Java

source: Close
pt_br: Fechar

source: Platform Settings
pt_br: Configurações da plataforma

source: Java Platform
pt_br: Plataforma Java

source: Infrastructure and APIs for configuring and searching Java platforms.
pt_br: Infraestrutura e APIs para configurar e pesquisar plataformas Java.

source: Provides APIs and a storage mechanism for configuration of different Java platforms, such as Java SE, Java EE, or Java ME.
pt_br: Fornece APIs e um mecanismo de armazenamento para configuração de diferentes plataformas Java, como Java SE, Java EE ou Java ME.

source: Registered platforms can be searched for use in projects.
pt_br: Plataformas registradas podem ser pesquisadas por utilizações em projetos.

source: Target platforms
pt_br: Plataformas de destino

source: Ruby Platforms
pt_br: Plataformas Ruby

source: Platforms
pt_br: Plataformas

source: Services
pt_br: Serviços

source: Java Platform Templates.
pt_br: Modelos de Plataforma Java.

source: Platform Folder:
pt_br: Diretório da plataforma:

source: Add Platform...
pt_br: Adicionar plataforma...

source: Add Java Platform
pt_br: Adicionar plataforma Java

source: Remove
pt_br: Remover

source: Java Platform &Manager
pt_br: Gerenciador de platafor&ma Java

source: Platform Name:
pt_br: Nome da plataforma:

source: Platform Manager lets you install and customize JDKs.
pt_br: O gerenciador de plataforma permite que você instale e personalize JDKs.

source: Installed Platforms
pt_br: Plataformas instaladas

source: &Platforms:
pt_br: &Plataformas:

source: Platform Type:
pt_br: Tipo da plataforma:

source: Platform Folder
pt_br: Diretório da plataforma

source: Choose Platform Folder
pt_br: Selecione o diretório da plataforma

source: Choose Platform Type
pt_br: Selecione o tipo da plataforma

source: Platform Information
pt_br: Informação da plataforma

source: Select platform type to install:
pt_br: Selecione o tipo de plataforma a instalar:

source: Select platform type
pt_br: Selecione o tipo de plataforma

source: Embedded Ruby (RHTML)
pt_br: Ruby embarcado (RHTML)

source: Rhtml Files
pt_br: Arquivos Rhtml

source: RHTML File
pt_br: Arquivo RHTML

source: ERB File
pt_br: Arquivo ERB

source: RHTML Editor Options
pt_br: Opções do editor RHTML

source: HTML Whitespace
pt_br: Espaço em branco do HTML

source: HTML Tag
pt_br: Marcação HTML

source: HTML Attribute of a Tag
pt_br: Atributo de uma marcação HTML

source: HTML Comment
pt_br: Comentário HTML

source: HTML Text
pt_br: Texto HTML

source: HTML Character Reference
pt_br: Referência de caractere HTML

source: HTML Operator
pt_br: Operador HTML

source: HTML Error
pt_br: Erro HTML

source: HTML Attribute Value
pt_br: Valor de atributo HTML

source: SGML Declaration
pt_br: Declaração SGML

source: SGML Comment
pt_br: Comentário SGML
